#Пищик Іван
#Функція відкриття файлу
def openFile(file_name, mode):
    try:
        file = open(file_name, mode, encoding='utf-8')
    except:
        print("Не можливо відкрити файл: ", file_name)
        exit(1);
    else:
        print("Файл", file_name, "успішно відкрито")
        return file

#Відкриття файлу
file_t = openFile("Text.txt", "w")

#Запис у файл
if file_t:
    # очищуємо файл, щоб не дублювати у файлі тескт написаний попередніми студентами
    file_t.truncate()

    # Пищик Іван
    file_t.write("Пищик Іван КН-32/2\n")  # Запис прізвища та групи
    file_t.write("Питання: Яка різниця між списком та кортежем у Python?\n")  # Запис питання
    # Дяченко Юлія
    file_t.write("\nДяченко Юлія КН-31/2\n"
                 "Список можна редагувати - це стосується як розміру списку, так і самих елементів у ньому.\n"
                 "А кортеж змінювати не можна.\n"
                 "Питання: В чому різниця між арифметичними операторами '/' та '// у Python'?\n")  # Запис питання
    # Івженко Тимофій
    file_t.write("\nІвженко Тимофій КН-31/2\n"
                 "Оператор / в Python виконує звичайне ділення з поверненням результату з дробовою частиною (float),\n"
                 "а // — це оператор цілочислового ділення, який повертає лише цілу частину результату, відкидаючи дробову.\n"
                 "Питання: Чим відрізняються операції ** та ^ у Python?\n")

    file_t.close()  # Закриваємо файл після запису
    print("Файл закрито.")  # Повідомлення про закриття файлу